name = ['夕張市', '岩見沢市', '美唄市', '芦別市', '赤平市', '三笠市', '滝川市', '砂川市', '歌志内市', '深川市', '南幌町', '奈井江町', '上砂川町', '由仁町', '長沼町', '栗山町', '月形町', '浦臼町', '新十津川町', '妹背牛町', '秩父別町', '雨竜町', '北竜町', '沼田町', '札幌市', '江別市', '千歳市', '恵庭市', '北広島市', '石狩市', '当別町', '新篠津村', '小樽市', '島牧村', '寿都町', '黒松内町', '蘭越町', 'ニセコ町', '真狩村', '留寿都村', '喜茂別町', '京極町', '俱知安町', '共和町', '岩内町', '泊村', '神恵内村', '積丹町', '古平町', '仁木町', '余市町', '赤井川村', '室蘭市', '苫小牧市', '登別市', '伊達市', '豊浦町', '壮瞥町', '白老町', '厚真町', '洞爺湖町', '安平町', 'むかわ町', '日高町', '平取町', '新冠町', '浦河町', '様似町', 'えりも町', '新ひだか町', '函館市', '北斗市', '松前町', '福島町', '知内町', '木古内町', '七飯町', '鹿部町', '森町', '八雲町', '長万部町', '江差町', '上ノ国町', '厚沢部町', '乙部町', '今金町', 'せたな町', '旭川市', '士別市', '名寄市', '富良野市', '鷹栖町', '東神楽町', '当麻町', '比布町', '愛別町', '上川町', '東川町', '美瑛町', '上富良野町', '中富良野町', '南富良野町', '占冠村', '和寒町', '剣淵町', '下川町', '美深町', '音威子府村', '中川町', '幌加内町', '留萌市', '増毛町', '小平町', '苫前町', '羽幌町', '初山別村', '遠別町', '天塩町', '稚内市', '猿払村', '浜頓別町', '中頓別町', '枝幸町', '豊富町', '幌延町', '北見市', '網走市', '紋別市', '美幌町', '津別町', '清里町', '斜里町', '小清水町', '訓子府町', '置戸町', '佐呂間町', '遠軽町', '湧別町', '滝上町', '興部町', '西興部村', '雄武町', '大空町', '帯広市', '音更町', '士幌町', '上士幌町', '鹿追町', '新得町', '清水町', '芽室町', '中札内村', '更別村', '大樹町', '広尾町', '幕別町', '池田町', '豊頃町', '本別町', '足寄町', '陸別町', '浦幌町', '釧路市', '釧路町', '厚岸町', '浜中町', '標茶町', '弟子屈町', '鶴居村', '白糠町', '根室市', '別海町', '中標津町', '標津町', '羅臼町']

inc_facility = ['苫小牧市', '釧路市', '札幌市', '室蘭市', '登別市', '伊達市', '帯広市', '旭川市', '函館市', '千歳市', '小樽市', '洞爺湖町', '北見市', '江別市', '白老町', 'むかわ町', '滝川市', '弟子屈町', '厚岸町', '岩見沢市', '中標津町', '稚内市', '八雲町', '網走市', '根室市', '新ひだか町', '遠軽町', '紋別市', '枝幸町', '浦河町']
inc_blocks = [['夕張市', '岩見沢市', '美唄市', '三笠市', '栗山町', '月形町', '新篠津村'], ['芦別市', '赤平市', '滝川市', '砂川市', '歌志内市', '深川市', '奈井江町', '上砂川町', '浦臼町', '新十津川町', '妹背牛町', '秩父別町', '雨竜町', '北竜町', '沼田町'], ['札幌市', '石狩市'], ['南幌町', '長沼町', '江別市', '北広島市', '当別町'], ['千歳市', '恵庭市'], ['小樽市', '積丹町', '古平町', '仁木町', '余市町', '赤井川村'], ['室蘭市'], ['苫小牧市'], ['登別市'], ['伊達市', '壮瞥町'], ['白老町'], ['島牧村', '寿都町', '黒松内町', '蘭越町', '真狩村', '留寿都村', '喜茂別町', '豊浦町', '洞爺湖町'], ['むかわ町', '日高町', '平取町'], ['浦河町', '様似町', 'えりも町'], ['新冠町', '新ひだか町'], ['函館市', '北斗市'], ['八雲町', '長万部町'], ['旭川市', '鷹栖町', '東神楽町', '当麻町', '比布町', '愛別町', '上川町', '東川町', '美瑛町', '和寒町', '幌加内町'], ['遠別町', '天塩町', '稚内市', '猿払村', '豊富町', '幌延町'], ['北見市', '美幌町', '津別町', '訓子府町', '置戸町', '陸別町'], ['網走市', '清里町', '斜里町', '小清水町', '大空町'], ['紋別市', '滝上町', '興部町', '西興部村', '雄武町'], ['佐呂間町', '遠軽町', '湧別町'], ['帯広市', '音更町', '士幌町', '上士幌町', '芽室町', '中札内村', '更別村'], ['釧路市'], ['音威子府村', '中川町', '浜頓別町', '中頓別町', '枝幸町'], ['厚岸町'], ['弟子屈町'], ['根室市'], ['別海町', '中標津町', '標津町', '羅臼町']]

trans_facility = ['釧路町', '安平町', '標茶町', '七飯町', '厚真町', '幕別町', '浜中町', '白糠町', '中富良野町', '名寄市', '留萌市', '俱知安町', '清水町', '鶴居村', '共和町', '江差町', '今金町', '士別市', '知内町', '大樹町']
trans_blocks = [['ニセコ町', '京極町', '俱知安町'], ['鶴居村'], ['厚真町'], ['由仁町', '安平町'], ['共和町', '岩内町', '泊村', '神恵内村'], ['釧路町'], ['江差町', '上ノ国町', '厚沢部町', '乙部町'], ['七飯町', '鹿部町', '森町'], ['名寄市', '下川町', '美深町'], ['富良野市', '上富良野町', '中富良野町'], ['士別市', '剣淵町'], ['留萌市', '増毛町', '小平町', '苫前町', '羽幌町', '初山別村'], ['今金町', 'せたな町'], ['松前町', '福島町', '知内町', '木古内町'], ['南富良野町', '占冠村', '鹿追町', '新得町', '清水町'], ['大樹町', '広尾町'], ['幕別町', '池田町', '豊頃町', '本別町', '足寄町', '浦幌町'], ['浜中町'], ['標茶町'], ['白糠町']]

arrows = [[['滝川市'], ['留萌市']], [['千歳市'], ['安平町']], [['小樽市'], ['共和町']], [['洞爺湖町'], ['俱知安町']], [['むかわ町'], ['厚真町']], [['函館市'], ['知内町', '七飯町']], [['八雲町'], ['江差町', '今金町']], [['旭川市'], ['士別市', '名寄市', '中富良野町']], [['帯広市'], ['大樹町', '幕別町', '清水町']], [['釧路市'], ['鶴居村', '白糠町', '釧路町']], [['厚岸町'], ['浜中町']], [['弟子屈町'], ['標茶町']]]




name_set = set(name)
inc_facility_set = set(inc_facility)
trans_facility_set = set(trans_facility)
inc_blocks_flattened = set([city for block in inc_blocks for city in block])
trans_blocks_flattened = set([city for block in trans_blocks for city in block])

import geopandas as gpd
# Shapefileのパス
shp_file_path = "C:\\Users\\hyo15\\remote_nohi_11_16\\hokkaido_shp\\hokkaido_sapporo_diffusion.shp"
gdf = gpd.read_file(shp_file_path, encoding="shift-jis")
# データの表示
# print(gdf.head())
# tancho_name_list = gdf['短縮名称'].tolist()
# print(tancho_name_list)
nameshp = ['栗山町', '更別村', '岩見沢市', '大樹町', '浦幌町', '美瑛町', '妹背牛町', '森町', '白老町', '西興部村', '日高町', '長万部町', '沼田町', '幕別町', '北斗市', '比布町', '北竜町', '清里町', '奈井江町', '羅臼町', '今金町', '仁木町', '幌加内町', '津別町', '伊達市', '礼文町', '遠軽町', '新得町', '室蘭市', '壮瞥町', '猿払村', '浜頓別町', '鷹栖町', '幌延町', '浦河町', '名寄市', '稚内市', '上砂川町', '本別町', '厚真町', '上士幌町', '雨竜町', '根室市', '遠別町', '新ひだか町', '美幌町', '夕張市', '赤平市', '富良野市', '上川町', '美深町', 'せたな町', '音威子府村', '秩父別町', '鹿部町', '当別町', '積丹町', '黒松内町', '月形町', '小清水町', '枝幸町', '神恵内村', '苫前町', '洞爺湖町', '蘭越町', 'ニセコ町', '岩内町', '佐呂間町', '赤井川村', '小樽市', '足寄町', '留萌市', 'むかわ町', '愛別町', '士別市', '音更町', '豊富町', '大空町', '中頓別町', '南富良野町', '北広島市', '三笠市', '八雲町', '福島町', '留別村', '増毛町', '恵庭市', '厚沢部町', '下川町', '滝上町', '札幌市', '苫小牧市', '京極町', '利尻富士町', '真狩村', '剣淵町', '斜里町', '国後郡泊村', '知内町', '木古内町', '標茶町', '釧路市', '新冠町', '美唄市', '新篠津村', '別海町', '池田町', '石狩市', '厚岸町', '羽幌町', '中標津町', '千歳市', '様似町', '江別市', '登別市', '島牧村', '七飯町', '中川町', '北見市', '色丹村', '広尾町', '雄武町', '奥尻町', '砂川市', '旭川市', '和寒町', '由仁町', '上富良野町', '浦臼町', '帯広市', '東川町', '士幌町', '留寿都村', '松前町', '訓子府町', '南幌町', '興部町', '紋別市', '倶知安町', '深川市', '釧路町', '利尻町', '清水町', '当麻町', '天塩町', '平取町', '白糠町', '陸別町', '豊頃町', '江差町', '弟子屈町', '乙部町', '新十津川町', '滝川市', '標津町', '浜中町', '網走市', '置戸町', '豊浦町', '上ノ国町', '初山別村', '東神楽町', '芽室町', '泊村', '寿都町', '古平町', '中札内村', '共和町', '長沼町', '中富良野町', 'えりも町', '芦別市', '湧別町', '鹿追町', '函館市', '余市町', '小平町', '歌志内市', '安平町', '占冠村', '喜茂別町', '鶴居村']


# nameにあってinc_facilityにない市町村
# print(name_set - inc_blocks_flattened - trans_blocks_flattened)
# overlap_between_inc_and_trans = inc_blocks_flattened & trans_blocks_flattened
# overlap_between_inc_and_trans

print(set(nameshp) - inc_blocks_flattened - trans_blocks_flattened)
print(f"{len(set(nameshp))}-{len(inc_blocks_flattened)}-{len(trans_blocks_flattened)}")
print(set(nameshp) - inc_facility_set - trans_facility_set)
print(len((set(nameshp) - inc_facility_set - trans_facility_set)))
print(f"{len(set(nameshp))}-{len(inc_facility_set)}-{len(trans_facility_set)}")