import gspread
from google.oauth2.service_account import Credentials

# スコープの設定
scopes = ['https://spreadsheets.google.com/feeds','https://www.googleapis.com/auth/drive']

# 秘密鍵（jsonファイル）を読み込み
credentials = Credentials.from_service_account_file('spreadpy-388612-7d16d56151a9.json', scopes=scopes)

# クライアントの取得
gc = gspread.authorize(credentials)

# Google Spreadsheet の操作
client = gspread.authorize(credentials)
spreadsheet = client.open_by_key('1IeAi9quWMKA-LyWZAMxu6bzzMtXdjKJr6h0NhiytMO0')
worksheet = spreadsheet.sheet1  # シート名を指定する場合は worksheet = spreadsheet.get_worksheet(index) を使用

# データを書き込む
name = ['夕張市', '岩見沢市', '美唄市', '芦別市', '赤平市', '三笠市', '滝川市', '砂川市', '歌志内市', '深川市', '南幌町', '奈井江町', '上砂川町', '由仁町', '長沼町', '栗山町', '月形町', '浦臼町', '新十津川町', '妹背牛町', '秩父別町', '雨竜町', '北竜町', '沼田町', '札幌市', '江別市', '千歳市', '恵庭市', '北広島市', '石狩市', '当別町', '新篠津村', '小樽市', '島牧村', '寿都町', '黒松内町', '蘭越町', 'ニセコ町', '真狩村', '留寿都村', '喜茂別町', '京極町', '俱知安町', '共和町', '岩内町', '泊村', '神恵内村', '積丹町', '古平町', '仁木町', '余市町', '赤井川村', '室蘭市', '苫小牧市', '登別市', '伊達市', '豊浦町', '壮瞥町', '白老町', '厚真町', '洞爺湖町', '安平町', 'むかわ町', '日高町', '平取町', '新冠町', '浦河町', '様似町', 'えりも町', '新ひだか町', '函館市', '北斗市', '松前町', '福島町', '知内町', '木古内町', '七飯町', '鹿部町', '森町', '八雲町', '長万部町', '江差町', '上ノ国町', '厚沢部町', '乙部町', '奥尻町', '今金町', 'せたな町', '旭川市', '士別市', '名寄市', '富良野市', '鷹栖町', '東神楽町', '当麻町', '比布町', '愛別町', '上川町', '東川町', '美瑛町', '上富良野町', '中富良野町', '南富良野町', '占冠村', '和寒町', '剣淵町', '下川町', '美深町', '音威子府村', '中川町', '幌加内町', '留萌市', '増毛町', '小平町', '苫前町', '羽幌町', '初山別村', '遠別町', '天塩町', '稚内市', '猿払村', '浜頓別町', '中頓別町', '枝幸町', '豊富町', '礼文町', '利尻町', '利尻富士町', '幌延町', '北見市', '網走市', '紋別市', '美幌町', '津別町', '清里町', '斜里町', '小清水町', '訓子府町', '置戸町', '佐呂間町', '遠軽町', '湧別町', '滝上町', '興部町', '西興部村', '雄武町', '大空町', '帯広市', '音更町', '士幌町', '上士幌町', '鹿追町', '新得町', '清水町', '芽室町', '中札内村', '更別村', '大樹町', '広尾町', '幕別町', '池田町', '豊頃町', '本別町', '足寄町', '陸別町', '浦幌町', '釧路市', '釧路町', '厚岸町', '浜中町', '標茶町', '弟子屈町', '鶴居村', '白糖町', '根室市', '別海町', '中標津町', '標津町', '羅臼町']  # 179市町村の名前のリスト
waste = [1489, 12638, 1927, 1984, 1053, 1095, 5831, 2419, 222, 2253, 265, 398, 153, 158, 513, 540, 887, 78, 513, 145, 166, 204, 118, 187, 349353, 24906, 25770, 6987, 10822, 9341, 1946, 412, 25049, 173, 576, 446, 0, 0, 0, 0, 0, 0, 0, 775, 2128, 552, 151, 171, 283, 360, 2489, 87, 20448, 42288, 11426, 6907, 641, 983, 3395, 458, 2163, 972, 624, 1225, 533, 973, 1342, 529, 535, 4277, 66649, 5150, 602, 351, 434, 571, 5008, 562, 1687, 1561, 435, 1314, 395, 532, 363, 373, 1160, 2370, 64890, 2062, 2243, 370, 474, 2584, 916, 522, 292, 794, 1435, 2024, 1238, 319, 200, 547, 299, 268, 84, 239, 3, 13, 44, 526, 101, 192, 97, 528, 37, 26, 24, 7127, 282, 439, 110, 1166, 33, 454, 213, 320, 24, 20809, 6299, 3325, 4063, 158, 324, 0, 619, 219, 141, 345, 2357, 638, 195, 184, 74, 170, 290, 35291, 7531, 625, 475, 441, 944, 1439, 2638, 2807, 201, 1237, 907, 4414, 621, 253, 505, 519, 140, 326, 38335, 4090, 1237, 692, 1021, 1337, 422, 528, 4736, 1994, 4837, 553, 342]  # 179市町村のごみ量のリスト

for i in range(len(name)):
    worksheet.update_cell(i+1, 1, name[i])  # 1列目に町村名を書き込む
    worksheet.update_cell(i+1, 2, waste[i])  # 2列目にごみ量を書き込む